---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricArea.GetValidViewsForTags
source: html/be0c10c4-f8b0-0149-0a73-2879cdec5076.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.GetValidViewsForTags Method

Gets ids of the views where tags and symbols can be placed for the FabricArea and/or FabricSheets

## Syntax (C#)
```csharp
public IList<ElementId> GetValidViewsForTags()
```

## Returns
The collection of View ElementIds.